---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricAreaType.CreateDefaultFabricAreaType(Autodesk.Revit.DB.Document)
source: html/facf29a9-6817-b8b9-94b8-18cabee91f3a.htm
---
# Autodesk.Revit.DB.Structure.FabricAreaType.CreateDefaultFabricAreaType Method

Creates a new FabricAreaType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultFabricAreaType(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null